SystemTest_of-ccx/referenceOutput_of-ccx/Outer-Fluid/system/fvOptions
FoamFile {
    version 2.0;
    class dictionary;
    object fvOptions;
    format ascii;
}
